week5/tunr-db/app/views/mixtapes/show.html.erb


<% if @current_user.present? && @current_user.id == @mixtape.user.id %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]

<ul>
<% @mixtape.songs.each do |song| %>
---
SELECT "songs".* FROM "songs" INNER JOIN "mixtapes_songs" ON "songs"."id" = "mixtapes_songs"."song_id" WHERE "mixtapes_songs"."mixtape_id" = $1  [["mixtape_id", 36]]