week5/planets-db/app/controllers/planets_controller.rb

    def create
        #raise "hell" #debugging

        #Beacuse of the 'form_with' helper created form input names like name ="planet[moons]" and name="planer[image_rl]", the form data we get in params is more nested. Therefore we need to write params[:planet][:moons] etc

        #TODO: make sure the planet was actully creewtaed and validate --later in the week

        Planet.create(
            name:       params[:planet][:name],
            mass:       params[:planet][:mass],
            orbit:      params[:planet][:orbit],
            moons:      params[:planet][:moons],
            image_url:  params[:planet][:image_url]

        )
---
INSERT INTO "planets" ("name", "image_url", "mass") VALUES (?, ?, ?)  [["name", "Forbidden Planer"], ["image_url", ""], ["mass", 11.0]]

    def index
        @planets = Planet.all
---
SELECT "planets".* FROM "planets"

    def show
        @planet = Planet.find params[:id]
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

    def edit
        @planet = Planet.find params[:id]
---
SELECT "planets".* FROM "planets"

    def update

            #raise "hell" #debugging

            #Beacuse of the 'form_with' helper created form input names like name ="planet[moons]" and name="planer[image_rl]", the form data we get in params is more nested. Therefore we need to write params[:planet][:moons] etc

            ###Make surE YOU GET THE PLANET FIRST###
            planet = Planet.find params[:id]

            planet.update(
                name:       params[:planet][:name],
                mass:       params[:planet][:mass],
                orbit:      params[:planet][:orbit],
                moons:      params[:planet][:moons],
                image_url:  params[:planet][:image_url]

            )
---
SELECT "planets".* FROM "planets"
UPDATE "planets" SET "name" = ? WHERE "planets"."id" = ?  [["name", "Mars"], ["id", 17]]

    def destroy
        Planet.destroy params[:id] #TODO: Validate that the destroy worked
---
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 19]]