week8/secrets-app/rails-secrets-server/app/controllers/secrets_controller.rb

    def index

        # Deal with CORS header checking for Ajax reqwuest by defining a response header
        # that states than any (*) requests are allowed to make
        # AJAX requests
        # headers['Access-Control-Allow-Origin'] = '*'
        # we covered thiss by installing a gem (rack-cors) and then adding a file in initialization:

        render json: Secret.all #send to the AJAX jscode, as json, an array of Secret objects.
        #This allows the front end to make an ajax request to access this information
---
SELECT "secrets".* FROM "secrets"

    def create

        secret = Secret.create content: params[:content]
---
INSERT INTO "secrets" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "This is a shocking secret"], ["created_at", "2022-09-13 05:50:20.475924"], ["updated_at", "2022-09-13 05:50:20.475924"]]