week7/fruitstore-tdd/app/controllers/fruits_controller.rb

INSERT INTO "fruits" ("created_at", "updated_at", "name", "price", "type", "shelf_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2022-09-06 04:55:24.443497"], ["updated_at", "2022-09-06 04:55:24.443497"], ["name", "Strawberry"], ["price", nil], ["type", nil], ["shelf_id", 277]]
---
  def create
    @fruit = Fruit.create fruit_params

SELECT "fruits".* FROM "fruits"
---
  def index
    @fruits = Fruit.all.reverse