week5/tunr-db/app/controllers/application_controller.rb

    def fetch_user


      #check if the user is logged in
      if session[:user_id].present?
        @current_user = User.find_by id: session[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]