week5/tunr-db/app/controllers/mixtapes_controller.rb

  def create
    #We have to use the @current_user to associate with a user (NOT IN THE FORM)

    #Do not send user_id through a form as it can be chaged with the dev tools

    #this assumes that the current actions is locked down by check_if_logged_in

    # @mixtape = Mixtape.create mixtape_params

    #Here are some ways to avoid passing uder_id through params

    #Option 1 : using <<
    #@current_user.mixtapes << @mixtape

    #Option 2:
    # @mixtape.user_id = @current_user.id
    # @mixtape.save

    #option 3
    #Use .new instead of .create, plus '=' and save

    @mixtape = Mixtape.new mixtape_params
    @mixtape.user_id = @current_user.id
    @mixtape.save #This then becomes the actual create line
---
INSERT INTO "mixtapes" ("name", "image", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "New one"], ["image", "https://www.placecage.com/c/200/300"], ["created_at", "2022-08-26 04:46:09.389711"], ["updated_at", "2022-08-26 04:46:09.389711"], ["user_id", 29]]

  def index
    @mixtapes = Mixtape.all
---
SELECT "mixtapes".* FROM "mixtapes"

  def show
    @mixtape = Mixtape.find params[:id]
---
SELECT  "mixtapes".* FROM "mixtapes" WHERE "mixtapes"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]

  def edit
    @mixtape = Mixtape.find params[:id]
---
SELECT  "mixtapes".* FROM "mixtapes" WHERE "mixtapes"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]

  def update

    @mixtape = Mixtape.find params[:id]

    # Check again that this mixtape belongs to the logged in user, since people can still work out the edit url
    if @mixtape.user.id != @current_user.id
      redirect_to login_path
      #also need to stop the code, otherwise the rest of the code will run and the other redirect will thro an error
      return # so we add this return


    end



    if @mixtape.update mixtape_params
---
SELECT  "mixtapes".* FROM "mixtapes" WHERE "mixtapes"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
UPDATE "mixtapes" SET "name" = $1, "updated_at" = $2 WHERE "mixtapes"."id" = $3  [["name", "Songs for Nic!~"], ["updated_at", "2022-08-26 06:08:27.096802"], ["id", 36]]