week5/tunr-db/app/controllers/session_controller.rb

  def create

    # 1. Check that the email address entered is actually in the DB

    user = User.find_by email: params[:email]
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "like@ga.co"], ["LIMIT", 1]]