week7/ajax-on-rails/app/controllers/messages_controller.rb

    def index
        render json: Message.all
---
SELECT "messages".* FROM "messages"

    def show
        render json: Message.find( params[:id] )
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def search
        render json: Message.where('content ILIKE ?', "%#{params[:query]}%") #the % here are part of a substring search. That is, the search params can appear anywhere within a larger string.  The I in ILIKE is case insensitive; LIKE is an SQL fuzzy search.
        # You can add fields by adding OR description ILIKE ? %otherthing%
---
SELECT "messages".* FROM "messages" WHERE (content ILIKE '%craig%')