week5/moma-app/app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "nationality", "period", "image", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Does "], ["nationality", "This"], ["period", ""], ["image", ""], ["bio", "Work?"], ["created_at", "2022-08-24 06:02:54.162684"], ["updated_at", "2022-08-24 06:02:54.162684"]]
---
  def create

    ####New way-- uses the private function below #####
    Artist.create artist_params

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @artist = Artist.find params[:id]

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def edit
    @artist = Artist.find params[:id]

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "artists" SET "roundness" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["roundness", 7], ["updated_at", "2022-08-24 06:11:38.576293"], ["id", 6]]
---
  def update
    artist = Artist.find params[:id]
    artist.update artist_params

DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 10]]
---
  def destroy
    Artist.destroy params[:id]