week5/moma-app/app/controllers/works_controller.rb

INSERT INTO "works" ("title", "year", "medium", "style", "image", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    Work.create work_params

SELECT "works".* FROM "works"
---
  def index
    @works = Work.all

SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]
---
  def show
    @work = Work.find params[:id]

SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
---
  def edit
    @work = Work.find params[:id]

SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
UPDATE "works" SET "title" = ?, "artist_id" = ?, "updated_at" = ? WHERE "works"."id" = ?  [["title", "Out of the depths!?"], ["artist_id", 50], ["updated_at", "2022-08-24 08:12:04.212387"], ["id", 27]]
---
  def update

    work = Work.find params[:id]
    work.update work_params

DELETE FROM "works" WHERE "works"."id" = ?  [["id", 33]]
---
  def destroy
    Work.destroy params[:id]